### Grades

In [1]:
import pandas as pd

grades = pd.Series([87, 100, 94])

In [2]:
grades

0     87
1    100
2     94
dtype: int64

In [3]:
grades[0]

87

In [9]:
print(grades.count())
print(grades.mean())
print(grades.min())
print(grades.max())
print(grades.std())
print(grades.describe())

3
93.66666666666667
87
100
6.506407098647712
count      3.000000
mean      93.666667
std        6.506407
min       87.000000
25%       90.500000
50%       94.000000
75%       97.000000
max      100.000000
dtype: float64

In [11]:
grades = pd.Series({'Wally': 87, 'Eva': 100, 'Sam': 94})

In [12]:
grades

Wally     87
Eva      100
Sam       94
dtype: int64

In [13]:
grades['Eva']

100

In [14]:
grades.Wally

87

In [15]:
grades.values

array([ 87, 100,  94], dtype=int64)

In [16]:
JamesStClair = 'Working on module 5'

In [17]:
JamesStClair

'Working on module 5'

In [18]:
grades_dict = {'Wally': [87, 96, 70], 'Eva': [100, 87, 90], 'Sam': [94, 77, 90], 'Katie': [100, 81, 82], 'Bob': [83, 65, 85]}

In [19]:
grades = pd.DataFrame(grades_dict)

In [20]:
grades

   Wally  Eva  Sam  Katie  Bob
0     87  100   94    100   83
1     96   87   77     81   65
2     70   90   90     82   85

In [21]:
grades.index = ['Test1', 'Test2', 'Test3']

In [22]:
grades

       Wally  Eva  Sam  Katie  Bob
Test1     87  100   94    100   83
Test2     96   87   77     81   65
Test3     70   90   90     82   85

In [23]:
grades['Eva']

Test1    100
Test2     87
Test3     90
Name: Eva, dtype: int64

In [24]:
grades.Sam

Test1    94
Test2    77
Test3    90
Name: Sam, dtype: int64

In [26]:
grades.loc['Test1']

Wally     87
Eva      100
Sam       94
Katie    100
Bob       83
Name: Test1, dtype: int64

In [33]:
grades.at['Test2','Eva']

87

In [34]:
grades.iat[2,0]

70

In [35]:
grades.describe()

           Wally         Eva        Sam       Katie        Bob
count   3.000000    3.000000   3.000000    3.000000   3.000000
mean   84.333333   92.333333  87.000000   87.666667  77.666667
std    13.203535    6.806859   8.888194   10.692677  11.015141
min    70.000000   87.000000  77.000000   81.000000  65.000000
25%    78.500000   88.500000  83.500000   81.500000  74.000000
50%    87.000000   90.000000  90.000000   82.000000  83.000000
75%    91.500000   95.000000  92.000000   91.000000  84.000000
max    96.000000  100.000000  94.000000  100.000000  85.000000

In [39]:
pd.set_option("display.precision",2)

In [38]:
print('it did not work as it matched multiple keys')

it did not work as it matched multiple keys

In [40]:
grades.mean()

Wally    84.33
Eva      92.33
Sam      87.00
Katie    87.67
Bob      77.67
dtype: float64

In [41]:
grades.sort_index(ascending=False)

       Wally  Eva  Sam  Katie  Bob
Test3     70   90   90     82   85
Test2     96   87   77     81   65
Test1     87  100   94    100   83

In [42]:
grades.sort_index(axis=1)

       Bob  Eva  Katie  Sam  Wally
Test1   83  100    100   94     87
Test2   65   87     81   77     96
Test3   85   90     82   90     70

In [43]:
JamesStClair

'Working on module 5'

### Optional Bonus

In [45]:
zips = pd.Series({'Boston': '02215', 'Miami': '3310'})

zips

Boston    02215
Miami      3310
dtype: object

In [46]:
zips.str.match(r'\d{5}')

Boston     True
Miami     False
dtype: bool

In [59]:
JamesStClair

'Working on module 5'

In [48]:
cities = pd.Series(['Boston, MA 02215', 'Miami, FL 33101'])

cities

0    Boston, MA 02215
1     Miami, FL 33101
dtype: object

In [49]:
cities.str.contains(r' [A-Z]{2} ')

0    True
1    True
dtype: bool

In [60]:
JamesStClair

'Working on module 5'

In [50]:
contacts = [['Mike Green', 'demo1@deitel.com', '5555555555'], ['Sue Brown', 'demo2@deitel.com', '5555551234']]

contactsdf = pd.DataFrame(contacts, columns=['Name', 'Email', 'Phone'])

contactsdf

         Name             Email       Phone
0  Mike Green  demo1@deitel.com  5555555555
1   Sue Brown  demo2@deitel.com  5555551234

In [57]:
import re

def get_formatted_phone(value):
    result = re.fullmatch(r'(\d{3})(\d{3})(\d{4})', value)
    return '-'.join(result.groups()) if result else value

formatted_phone = contactsdf['Phone'].map(get_formatted_phone)

formatted_phone

0    555-555-5555
1    555-555-1234
Name: Phone, dtype: object

In [58]:
contactsdf['Phone'] = formatted_phone

contactsdf

         Name             Email         Phone
0  Mike Green  demo1@deitel.com  555-555-5555
1   Sue Brown  demo2@deitel.com  555-555-1234

In [61]:
JamesStClair

'Working on module 5'